tap "d12frosted/emacs-plus"
tap "homebrew-zathura/zathura"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"
brew "libtiff"
brew "aspell"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "bc"
brew "bob"
brew "glib"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "deno"
brew "exiftool"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gawk"
brew "gdb"
brew "gh"
brew "glab"
brew "gnu-sed"
brew "graphicsmagick"
brew "imagemagick"
brew "jq"
brew "node"
brew "jupyterlab"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "mailsy"
brew "mingw-w64"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "nowplaying-cli"
brew "openjdk"
brew "python@3.12"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "powerlevel10k"
brew "pure"
brew "pytest"
brew "ripgrep"
brew "sk"
brew "sl"
brew "starship"
brew "stow"
brew "telnet"
brew "texlive"
brew "tmux"
brew "tree"
brew "typst"
brew "xclip"
brew "zsh-syntax-highlighting"
brew "d12frosted/emacs-plus/emacs-plus@30", link: false
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "aerospace"
cask "alacritty"
cask "dbeaver-community"
cask "font-hack-nerd-font"
cask "iterm2"
cask "jetbrains-toolbox"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-word"
cask "obs"
cask "stats"
cask "tomatobar"
cask "vscodium"
vscode "adpyke.codesnap"
vscode "amodio.toggle-excluded-files"
vscode "be5invis.vscode-custom-css"
vscode "bschulte.love"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "hediet.vscode-drawio"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "patricknasralla.tokyo-night-moon"
vscode "sumneko.lua"
vscode "teamdman.super-factory-manager-language"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "yy0931.mplstyle"
